### Importacion de Librerias

In [1]:
import pandas as pd
import numpy as np

### Importacion de los datos

In [2]:
raw_csv_data = pd.read_csv("Index_united.csv") 
df_comp=raw_csv_data.copy()

### Limpieza de los datos

In [3]:
#Muestra de las columnas del dataframe
df_comp.columns
df_comp.drop(columns='Unnamed: 0',inplace=True)

#### Conversion de los datos de la columna **date** en formato fecha

In [4]:
from datetime import datetime

date_string = "13/01/1994"
format = "%d/%m/%Y"

try:
    date = datetime.strptime(date_string, format)
    print(date)
except ValueError as e:
    print("Error:", e)

1994-01-13 00:00:00

### Tamaño del tiempo de la data

In [5]:
df_comp.describe()## Observacion de los momentos muestrales de cada serie de los precios de cada columna

               spx           dax         ftse        nikkei
count  7752.000000   7752.000000  7752.000000   7752.000000
mean   1723.576196   7498.407811  5748.635567  16649.531575
std    1040.265768   3893.125784  1251.664602   5794.663737
min     438.920000   1911.700000  2876.600000   7054.980000
25%    1085.027500   4495.042500  4904.747500  11359.932500
50%    1330.646624   6494.305000  5925.315000  16413.775000
75%    2106.682447  10676.682500  6695.818232  20224.452500
max    4796.560059  16469.750000  8014.299805  33753.328125

In [6]:
df_comp.head()##Primeros registros de la data

         date     spx      dax     ftse    nikkei
0  07/01/1994  469.90  2224.95  3445.98  18124.01
1  10/01/1994  475.27  2225.00  3440.58  18443.44
2  11/01/1994  474.13  2228.10  3413.77  18485.25
3  12/01/1994  474.17  2182.06  3372.02  18793.88
4  13/01/1994  472.47  2142.37  3360.01  18577.26

In [7]:
df_comp.date.describe()  ##Momentos muestrales de la serie date

count           7752
unique          7752
top       07/01/1994
freq               1
Name: date, dtype: object

In [8]:
df_comp.head()

         date     spx      dax     ftse    nikkei
0  07/01/1994  469.90  2224.95  3445.98  18124.01
1  10/01/1994  475.27  2225.00  3440.58  18443.44
2  11/01/1994  474.13  2228.10  3413.77  18485.25
3  12/01/1994  474.17  2182.06  3372.02  18793.88
4  13/01/1994  472.47  2142.37  3360.01  18577.26

In [9]:
df_comp.date.describe()

count           7752
unique          7752
top       07/01/1994
freq               1
Name: date, dtype: object

### Marcando el indice de cada cotizacion

In [10]:
df_comp.set_index("date")

                    spx           dax         ftse        nikkei
date
07/01/1994   469.900000   2224.950000  3445.980000  18124.010000
10/01/1994   475.270000   2225.000000  3440.580000  18443.440000
11/01/1994   474.130000   2228.100000  3413.770000  18485.250000
12/01/1994   474.170000   2182.060000  3372.020000  18793.880000
13/01/1994   472.470000   2142.370000  3360.010000  18577.260000
...                 ...           ...          ...           ...
2023-10-04  4263.750000  15099.919922  7412.500000  30526.880859
2023-10-05  4258.189941  15070.219727  7451.500000  31075.359375
2023-10-06  4308.500000  15229.769531  7494.600098  30994.669922
2023-10-09  4335.660156  15128.110352  7492.200195  30994.669922
2023-10-10  4358.240234  15423.519531  7628.200195  31746.529297

[7752 rows x 4 columns]

In [11]:
df_comp.set_index("date", inplace=True) #Sitiando sobre la misma variable

In [12]:
df_comp.head()

               spx      dax     ftse    nikkei
date
07/01/1994  469.90  2224.95  3445.98  18124.01
10/01/1994  475.27  2225.00  3440.58  18443.44
11/01/1994  474.13  2228.10  3413.77  18485.25
12/01/1994  474.17  2182.06  3372.02  18793.88
13/01/1994  472.47  2142.37  3360.01  18577.26

### Muestra de frecuencia preferida

In [13]:
df_compd=df_comp.asfreq('d') ##Freecuencia diaria

C:\Users\ediso\AppData\Local\Temp\ipykernel_12728\1769314186.py:1: UserWarning: Parsing dates in DD/MM/YYYY format when dayfirst=False (the default) was specified. This may lead to inconsistently parsed dates! Specify a format to ensure consistent parsing.
  df_comp=df_comp.asfreq('d') ##Freecuencia diaria

In [14]:
df_compd

            spx  dax  ftse  nikkei
date
1996-01-01  NaN  NaN   NaN     NaN
1996-01-02  NaN  NaN   NaN     NaN
1996-01-03  NaN  NaN   NaN     NaN
1996-01-04  NaN  NaN   NaN     NaN
1996-01-05  NaN  NaN   NaN     NaN
...         ...  ...   ...     ...
2015-12-27  NaN  NaN   NaN     NaN
2015-12-28  NaN  NaN   NaN     NaN
2015-12-29  NaN  NaN   NaN     NaN
2015-12-30  NaN  NaN   NaN     NaN
2015-12-31  NaN  NaN   NaN     NaN

[7305 rows x 4 columns]

In [15]:
df_compb=df_comp.asfreq('b') # Frecuencia bimestral

In [16]:
df_compb.head() ## Primeros registros

            spx  dax  ftse  nikkei
date
1996-01-01  NaN  NaN   NaN     NaN
1996-01-02  NaN  NaN   NaN     NaN
1996-01-03  NaN  NaN   NaN     NaN
1996-01-04  NaN  NaN   NaN     NaN
1996-01-05  NaN  NaN   NaN     NaN

### Handling Missing Values

In [17]:
df_compb.isna() ## Verificaion de nulos en el dataframe

             spx   dax  ftse  nikkei
date
1996-01-01  True  True  True    True
1996-01-02  True  True  True    True
1996-01-03  True  True  True    True
1996-01-04  True  True  True    True
1996-01-05  True  True  True    True
...          ...   ...   ...     ...
2015-12-25  True  True  True    True
2015-12-28  True  True  True    True
2015-12-29  True  True  True    True
2015-12-30  True  True  True    True
2015-12-31  True  True  True    True

[5219 rows x 4 columns]

In [18]:
df_compb.isna().sum() ##Suma de los datos nulos del dataframe de cada columna

spx       5219
dax       5219
ftse      5219
nikkei    5219
dtype: int64

In [19]:
df_compb

            spx  dax  ftse  nikkei
date
1996-01-01  NaN  NaN   NaN     NaN
1996-01-02  NaN  NaN   NaN     NaN
1996-01-03  NaN  NaN   NaN     NaN
1996-01-04  NaN  NaN   NaN     NaN
1996-01-05  NaN  NaN   NaN     NaN
...         ...  ...   ...     ...
2015-12-25  NaN  NaN   NaN     NaN
2015-12-28  NaN  NaN   NaN     NaN
2015-12-29  NaN  NaN   NaN     NaN
2015-12-30  NaN  NaN   NaN     NaN
2015-12-31  NaN  NaN   NaN     NaN

[5219 rows x 4 columns]

In [1]:
##Imputacion  de datos sobre los datos nulos de manera que reemplazará los valores faltantes con el valor de la fila anterior en la misma columna
df_comp.spx=df_comp.spx.fillna(method='ffill')

NameError: name 'df_comp' is not defined

In [21]:
df_comp.isna().sum()#Suma de datos nulos

spx       5219
dax       5219
ftse      5219
nikkei    5219
dtype: int64

In [22]:
##Imputacion  de datos sobre los datos nulos de manera queque reemplazará los valores faltantes con el valor de la fila siguiente en la misma columna.
df_comp.ftse=df_comp.ftse.fillna(method='bfill')

In [24]:
##Imputacion  de datos sobre los datos nulos de manera queque reemplazará los valores faltantes con el valor de la media
df_comp.dax=df_comp.dax.fillna(value = df_comp.dax.mean())

### Simplificando los datos

In [25]:
## Nuevaa Variable **market_value** (capitakizacion de mercado) o activo corresponde al indice **GSPC**
df_comp['market_value']=df_comp.spx

In [26]:
df_comp.describe()

       spx  dax  ftse  nikkei  market_value
count  0.0  0.0   0.0     0.0           0.0
mean   NaN  NaN   NaN     NaN           NaN
std    NaN  NaN   NaN     NaN           NaN
min    NaN  NaN   NaN     NaN           NaN
25%    NaN  NaN   NaN     NaN           NaN
50%    NaN  NaN   NaN     NaN           NaN
75%    NaN  NaN   NaN     NaN           NaN
max    NaN  NaN   NaN     NaN           NaN

In [27]:
del df_comp['spx'] # Eliminacion original de los datos de GSPC

In [28]:
df_comp.describe() # Descripcion de los datos

       dax  ftse  nikkei  market_value
count  0.0   0.0     0.0           0.0
mean   NaN   NaN     NaN           NaN
std    NaN   NaN     NaN           NaN
min    NaN   NaN     NaN           NaN
25%    NaN   NaN     NaN           NaN
50%    NaN   NaN     NaN           NaN
75%    NaN   NaN     NaN           NaN
max    NaN   NaN     NaN           NaN

In [29]:
# Eliminacion original de los datos de cada indice
del df_comp['dax'] 
del df_comp['ftse']
del df_comp['nikkei']

In [30]:
df_comp.describe()

       market_value
count           0.0
mean            NaN
std             NaN
min             NaN
25%             NaN
50%             NaN
75%             NaN
max             NaN

### Separacion de la data en train y test

In [ ]:
size = int(len(df_comp)*0.8)

In [ ]:
df = df_comp.iloc[:size]

In [38]:
df_test = df_comp.iloc[size:]

In [39]:
df.tail()

            market_value
date
2013-04-01   1562.173837
2013-04-02   1570.252238
2013-04-03   1553.686978
2013-04-04   1559.979316
2013-04-05   1553.278930

In [40]:
df_test.head()

            market_value
date
2013-04-08   1563.071269
2013-04-09   1568.607909
2013-04-10   1587.731827
2013-04-11   1593.369863
2013-04-12   1588.854623